---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsAttachmentTypeChanged
source: html/a4e69222-df6f-43e8-d771-8057ede14f59.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsAttachmentTypeChanged Property

Indicates if the attachment type has changed since the last regeneration.

## Syntax (C#)
```csharp
public bool IsAttachmentTypeChanged { get; }
```